responseTemplates_old/SDPMTProductUseQuery.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header>
        <gbo:UCBRUHeaders xmlns:gbo="urn:ucbru:gbo:v5">
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>SDPMT.SDPMTProductUseQuery</gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2024-01-29T10:29:41.838+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment></gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SDPMT.SDPMTProductUseQuery</gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2024-01-29T10:29:48.440+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment></gbo:Comment>
                    </gbo:Step>
                </gbo:MessagePath>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <sdpmt:SDPMTProductUse xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sdpmt="urn:ucbru:gbo:v5:sdpmt">
            <sdpmt:Code>SUCCESS</sdpmt:Code>
            <sdpmt:CustomerNo>00515511</sdpmt:CustomerNo>
            <sdpmt:FirstName>Mark</sdpmt:FirstName>
            <sdpmt:LastName>Sekamov</sdpmt:LastName>
            <sdpmt:MiddleName>Arkadievich</sdpmt:MiddleName>
            <sdpmt:Setting>
                <sdpmt:Identity>0070000000002</sdpmt:Identity>
                <sdpmt:Status>Y</sdpmt:Status>
                <sdpmt:DefaultAccountIdentity>
                    <sdpmt:CBAccount>40817810450010714090</sdpmt:CBAccount>
                </sdpmt:DefaultAccountIdentity>
            </sdpmt:Setting>
            <sdpmt:AvailableAccounts>
                <sdpmt:AccountIdentity>
                    <sdpmt:CBAccount>40817810450010714090</sdpmt:CBAccount>
                </sdpmt:AccountIdentity>
                <sdpmt:Status>Y</sdpmt:Status>
            </sdpmt:AvailableAccounts>
            <sdpmt:AvailableAccounts>
                <sdpmt:AccountIdentity>
                    <sdpmt:CBAccount>40817810250010491209</sdpmt:CBAccount>
                </sdpmt:AccountIdentity>
                <sdpmt:Status>N</sdpmt:Status>
            </sdpmt:AvailableAccounts>
            <sdpmt:AvailableAccounts>
                <sdpmt:AccountIdentity>
                    <sdpmt:CBAccount>40817810950010118617</sdpmt:CBAccount>
                </sdpmt:AccountIdentity>
                <sdpmt:Status>N</sdpmt:Status>
            </sdpmt:AvailableAccounts>
            <sdpmt:OperationStatistics>
                <sdpmt:MemberList>
                    <sdpmt:BankId>1crt88888881</sdpmt:BankId>
                    <sdpmt:BankId>100000000030</sdpmt:BankId>
                </sdpmt:MemberList>
            </sdpmt:OperationStatistics>
        </sdpmt:SDPMTProductUse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>